app/views/meals/show.html.haml

SELECT "orders".* FROM "orders" WHERE "orders"."meal_id" = 3
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
---
  %li= @meal.servings
  - @meal.orders.each do |order|
    -if order.user.present?