app/controllers/meals_controller.rb

  def index
    @meals = Meal.where(:user_id => @auth.id)
---
SELECT "meals".* FROM "meals" WHERE "meals"."user_id" = 1

  def create
    @meal = Meal.new params[:meal]
    @meal.user = @auth
    if @meal.save
---
INSERT INTO "meals" ("address", "created_at", "cuisine", "image", "latitude", "longitude", "name", "notes", "price", "servings", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12) RETURNING "id"

  def show
    @meal = Meal.find(params[:id])
---
SELECT meals.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.8804462 - meals.latitude) * PI() / 180 / 2), 2) + COS(-33.8804462 * PI() / 180) * COS(meals.latitude * PI() / 180) * POWER(SIN((151.2003283 - meals.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(meals.longitude - 151.2003283), RADIANS(meals.latitude - -33.8804462))) + 360 AS decimal) % 360 AS bearing FROM "meals" WHERE (meals.latitude BETWEEN -34.02517798311085 AND -33.73571441688915 AND meals.longitude BETWEEN 151.02599520820417 AND 151.37466139179583 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((-33.8804462 - meals.latitude) * PI() / 180 / 2), 2) + COS(-33.8804462 * PI() / 180) * COS(meals.latitude * PI() / 180) * POWER(SIN((151.2003283 - meals.longitude) * PI() / 180 / 2), 2))) <= 10 AND meals.id != 1) ORDER BY distance ASC

  def edit
    @meal = Meal.find(params[:id])
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", "1"]]

  def update
    @meal = Meal.find(params[:id])
    if @meal.user = @auth
      if @meal.update_attributes(params[:meal])
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", "1"]]
UPDATE "meals" SET "servings" = 6, "updated_at" = '2013-10-28 22:57:58.288086' WHERE "meals"."id" = 1

  def destroy
    meal = Meal.find(params[:id])
    if meal.user_id = @auth.id
      meal.destroy
---
SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", "1"]]
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 1]]