app/controllers/orders_controller.rb

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", "2"]]
---
  def new
    @meals = Meal.where(:id => params[:id])

SELECT "meals".* FROM "meals" WHERE "meals"."id" = $1 LIMIT 1  [["id", "2"]]
INSERT INTO "orders" ("created_at", "expiry", "meal_id", "servings", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["created_at", Tue, 29 Oct 2013 00:46:40 UTC +00:00], ["expiry", nil], ["meal_id", 2], ["servings", nil], ["updated_at", Tue, 29 Oct 2013 00:46:40 UTC +00:00], ["user_id", nil]]
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 3]]
---
  def create
    @meal = Meal.find(params[:id])
    @order = Order.new params[:order]
    @order.status = "requested"
    @order.user = @auth
    @auth.orders << @order
    @meal.orders << @order