app/controllers/pages_controller.rb

def home
  if params[:search].present?
    @meals = Meal.near(params[:search], params[:distance], :order => :distance)
    if @meals.count == 0
      @meal_message = true
      @meals = Meal.all
---
SELECT meals.*, 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((40.7143528 - meals.latitude) * PI() / 180 / 2), 2) + COS(40.7143528 * PI() / 180) * COS(meals.latitude * PI() / 180) * POWER(SIN((-74.00597309999999 - meals.longitude) * PI() / 180 / 2), 2))) AS distance, CAST(DEGREES(ATAN2( RADIANS(meals.longitude - -74.00597309999999), RADIANS(meals.latitude - 40.7143528))) + 360 AS decimal) % 360 AS bearing FROM "meals" WHERE (meals.latitude BETWEEN 40.56962101688915 AND 40.85908458311085 AND meals.longitude BETWEEN -74.19691944341237 AND -73.81502675658761 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((40.7143528 - meals.latitude) * PI() / 180 / 2), 2) + COS(40.7143528 * PI() / 180) * COS(meals.latitude * PI() / 180) * POWER(SIN((-74.00597309999999 - meals.longitude) * PI() / 180 / 2), 2))) <= 10) ORDER BY distance