app/controllers/users_controller.rb

  def create
    @user = User.new params[:user]
    if @user.save
---
INSERT INTO "users" ("bio", "cook", "created_at", "email", "fname", "image", "lname", "password_digest", "phone", "updated_at", "username") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"